//画布的大小
var canvas_size = {"maxX": 1000, "maxY": 500};
//顶点的圆圈半径
var vertex_radius = 10;

//数组中每个元素表示一个点的坐标[x,y,z]，这里一共有9个点
var vertex_pos = [
    [10, 12, 0],
    [500, 10, 0],
    [900, 30, 0],
    [10, 205, 0],
    [500, 210, 0],
    [900, 200, 0],
    [10, 400, 0],
    [600, 450, 0],
    [900, 420, 0]
];

//顶点颜色数组，保存了上面顶点数组中每个顶点颜色信息[r,g,b]
var vertex_color = [
    [0, 0, 255],
    [0, 255, 0],
    [0, 255, 255],
    [255, 255, 0],
    [0, 255, 255],
    [0, 255, 0],
    [0, 255, 0],
    [0, 200, 100],
    [255, 255, 0]
];

//四边形数组，数组中每个元素表示一个四边形，其中的四个数字是四边形四个顶点的index，例如vertex[polygon[2][1]]表示第三个多边形的第2个顶点的坐标
var polygon = [
    [0, 1, 4, 3],
    [1, 2, 5, 4],
    [3, 4, 7, 6],
    [4, 5, 8, 7]
];
